package do_doom_chit;

import java.awt.Container;

/**
 * 썸탈거야 게임을 만드는 클래스 
 * 
 * @since 2017-10-14
 * @date 2017.11.16
 * @author 심기성
 * @version 1.0
 */

public class Anziyoung extends Thread {
	private Music introMusic = new Music("Some.mp3", true);

	int NoteTime[][];
	boolean item;
	public Container contentPane;
	
	Anziyoung(boolean item){
		this.item = item;
		this.contentPane = contentPane;
	}
	

	/**
	 * 이 메소드는 쓰레드를 이용하기위한 메소드이고 안에 각 배열마다 각 키에 해당되는 노트 시간값을 가지고 있다 각 노트 시간과 이
	 * 클래스에 선언되어 있는 음악을 인자로 하여 게임 을 호출하게 된다
	 *
	 */
	public void run() {
		int NoteTime[][] = new int[4][100];

		NoteTime[0] = new int[] { 9400, 20700, 30100, 34900, 44000, 49800, 69500, 84400, 88400, 99400, 113600, 118500,
				125100, 126000, 134700, 147200, 152500, 160000, 162300, 166300, 175500, 10000000 };
		NoteTime[1] = new int[] { 6000, 9700, 15200, 19900, 23300, 27900, 32400, 39400, 44300, 47500, 53900, 62500,
				76400, 86700, 89600, 94800, 99700, 108700, 114000, 118800, 124800, 126300, 128800, 134300, 138700,
				145000, 149600, 153100, 157400, 161200, 163500, 166600, 170900, 176400, 10000000 };
		NoteTime[2] = new int[] { 3700, 10000, 10800, 15200, 20100, 23300, 29000, 31400, 39700, 44700, 49800, 53600,
				57900, 77800, 84400, 88400, 95100, 100000, 108900, 113100, 117900, 119000, 125100, 126000, 134100,
				138900, 147200, 152800, 157700, 160000, 162300, 166900, 175500, 176700, 10000000 };
		NoteTime[3] = new int[] { 10300, 20400, 26700, 33700, 34900, 40000, 47500, 53300, 69500, 71800, 76600, 77200,
				86700, 89500, 95400, 109200, 113400, 118200, 124800, 126200, 129200, 139200, 145000, 149600, 157100,
				161200, 163500, 170900, 177300, 10000000 };

		Game normal = new Game(introMusic, NoteTime,item);
	}
}
